dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l41x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L41x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L41x_PINMUX_H_)
# define _STM32L41x_PINMUX_H_

#define COMP1_OUT_FUNC           0
#define CRS_SYNC_FUNC            1
#define EVENTOUT_FUNC            2
#define I2C1_SCL_FUNC            3
#define I2C1_SDA_FUNC            4
#define I2C1_SMBA_FUNC           5
#define I2C2_SCL_FUNC            6
#define I2C2_SDA_FUNC            7
#define I2C2_SMBA_FUNC           8
#define I2C3_SCL_FUNC            9
#define I2C3_SDA_FUNC            10
#define I2C3_SMBA_FUNC           11
#define IR_OUT_FUNC              12
#define LPTIM1_ETR_FUNC          13
#define LPTIM1_IN1_FUNC          14
#define LPTIM1_IN2_FUNC          15
#define LPTIM1_OUT_FUNC          16
#define LPTIM2_ETR_FUNC          17
#define LPTIM2_IN1_FUNC          18
#define LPTIM2_OUT_FUNC          19
#define LPUART1_CTS_FUNC         20
#define LPUART1_DE_FUNC          21
#define LPUART1_RTS_FUNC         22
#define LPUART1_RX_FUNC          23
#define LPUART1_TX_FUNC          24
#define QUADSPI_BK1_IO0_FUNC     25
#define QUADSPI_BK1_IO1_FUNC     26
#define QUADSPI_BK1_IO2_FUNC     27
#define QUADSPI_BK1_IO3_FUNC     28
#define QUADSPI_BK1_NCS_FUNC     29
#define QUADSPI_CLK_FUNC         30
#define RCC_MCO_FUNC             31
#define RTC_OUT2_FUNC            32
#define RTC_OUT_ALARM_FUNC       33
#define RTC_OUT_CALIB_FUNC       34
#define RTC_REFIN_FUNC           35
#define SPI1_MISO_FUNC           36
#define SPI1_MOSI_FUNC           37
#define SPI1_NSS_FUNC            38
#define SPI1_SCK_FUNC            39
#define SPI2_MISO_FUNC           40
#define SPI2_MOSI_FUNC           41
#define SPI2_NSS_FUNC            42
#define SPI2_SCK_FUNC            43
#define SYS_JTCK_SWCLK_FUNC      44
#define SYS_JTDI_FUNC            45
#define SYS_JTDO_SWO_FUNC        46
#define SYS_JTMS_SWDIO_FUNC      47
#define SYS_JTRST_FUNC           48
#define SYS_TRACECLK_FUNC        49
#define SYS_TRACED0_FUNC         50
#define SYS_TRACED1_FUNC         51
#define SYS_TRACED2_FUNC         52
#define SYS_TRACED3_FUNC         53
#define TIM15_BKIN_FUNC          54
#define TIM15_CH1_FUNC           55
#define TIM15_CH1N_FUNC          56
#define TIM15_CH2_FUNC           57
#define TIM16_BKIN_FUNC          58
#define TIM16_CH1_FUNC           59
#define TIM16_CH1N_FUNC          60
#define TIM1_BKIN_FUNC           61
#define TIM1_BKIN2_FUNC          62
#define TIM1_BKIN2_COMP1_FUNC    63
#define TIM1_CH1_FUNC            64
#define TIM1_CH1N_FUNC           65
#define TIM1_CH2_FUNC            66
#define TIM1_CH2N_FUNC           67
#define TIM1_CH3_FUNC            68
#define TIM1_CH3N_FUNC           69
#define TIM1_CH4_FUNC            70
#define TIM1_ETR_FUNC            71
#define TIM2_CH1_FUNC            72
#define TIM2_CH2_FUNC            73
#define TIM2_CH3_FUNC            74
#define TIM2_CH4_FUNC            75
#define TIM2_ETR_FUNC            76
#define TSC_G1_IO1_FUNC          77
#define TSC_G1_IO2_FUNC          78
#define TSC_G1_IO3_FUNC          79
#define TSC_G1_IO4_FUNC          80
#define TSC_G2_IO1_FUNC          81
#define TSC_G2_IO2_FUNC          82
#define TSC_G2_IO3_FUNC          83
#define TSC_G2_IO4_FUNC          84
#define TSC_G3_IO1_FUNC          85
#define TSC_G3_IO2_FUNC          86
#define TSC_G3_IO3_FUNC          87
#define TSC_G3_IO4_FUNC          88
#define TSC_G4_IO1_FUNC          89
#define TSC_G4_IO2_FUNC          90
#define TSC_G4_IO3_FUNC          91
#define TSC_G4_IO4_FUNC          92
#define TSC_SYNC_FUNC            93
#define USART1_CK_FUNC           94
#define UART1_CK_FUNC            94
#define USART1_CTS_FUNC          95
#define UART1_CTS_FUNC           95
#define USART1_DE_FUNC           96
#define UART1_DE_FUNC            96
#define USART1_RTS_FUNC          97
#define UART1_RTS_FUNC           97
#define USART1_RX_FUNC           98
#define UART1_RX_FUNC            98
#define USART1_TX_FUNC           99
#define UART1_TX_FUNC            99
#define USART2_CK_FUNC           100
#define UART2_CK_FUNC            100
#define USART2_CTS_FUNC          101
#define UART2_CTS_FUNC           101
#define USART2_DE_FUNC           102
#define UART2_DE_FUNC            102
#define USART2_RTS_FUNC          103
#define UART2_RTS_FUNC           103
#define USART2_RX_FUNC           104
#define UART2_RX_FUNC            104
#define USART2_TX_FUNC           105
#define UART2_TX_FUNC            105
#define USART3_CK_FUNC           106
#define UART3_CK_FUNC            106
#define USART3_CTS_FUNC          107
#define UART3_CTS_FUNC           107
#define USART3_DE_FUNC           108
#define UART3_DE_FUNC            108
#define USART3_RTS_FUNC          109
#define UART3_RTS_FUNC           109
#define USART3_RX_FUNC           110
#define UART3_RX_FUNC            110
#define USART3_TX_FUNC           111
#define UART3_TX_FUNC            111
#define USB_DM_FUNC              112
#define USB_DP_FUNC              113
#define USB_NOE_FUNC             114

# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == COMP1_OUT_FUNC           )) ? 12 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ? 14 : \
	((gpio == PA00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PA01) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == TIM15_CH1N_FUNC          )) ? 14 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PA02) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PA02) && (func == TIM15_CH1_FUNC           )) ? 14 : \
	((gpio == PA02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PA03) && (func == QUADSPI_CLK_FUNC         )) ? 10 : \
	((gpio == PA03) && (func == TIM15_CH2_FUNC           )) ? 14 : \
	((gpio == PA03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == LPTIM2_OUT_FUNC          )) ? 14 : \
	((gpio == PA04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PA05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == COMP1_OUT_FUNC           )) ?  6 : \
	((gpio == PA06) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PA06) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PA06) && (func == QUADSPI_BK1_IO3_FUNC     )) ? 10 : \
	((gpio == PA06) && (func == TIM16_CH1_FUNC           )) ? 14 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == QUADSPI_BK1_IO2_FUNC     )) ? 10 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == LPTIM2_OUT_FUNC          )) ? 14 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == TIM15_BKIN_FUNC          )) ? 14 : \
	((gpio == PA09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == CRS_SYNC_FUNC            )) ? 10 : \
	((gpio == PA10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PA11) && (func == TIM1_BKIN2_FUNC          )) ?  2 : \
	((gpio == PA11) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA11) && (func == COMP1_OUT_FUNC           )) ?  6 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USB_DM_FUNC              )) ? 10 : \
	((gpio == PA11) && (func == TIM1_BKIN2_COMP1_FUNC    )) ? 12 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PA12) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == USB_DP_FUNC              )) ? 10 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA13) && (func == SYS_JTMS_SWDIO_FUNC      )) ?  0 : \
	((gpio == PA13) && (func == IR_OUT_FUNC              )) ?  1 : \
	((gpio == PA13) && (func == USB_NOE_FUNC             )) ? 10 : \
	((gpio == PA13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA14) && (func == SYS_JTCK_SWCLK_FUNC      )) ?  0 : \
	((gpio == PA14) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PA14) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PA14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA15) && (func == SYS_JTDI_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == USART2_RX_FUNC           )) ?  3 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PA15) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PA15) && (func == TSC_G3_IO1_FUNC          )) ?  9 : \
	((gpio == PA15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB00) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB00) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PB00) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB00) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PB00) && (func == COMP1_OUT_FUNC           )) ? 12 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB01) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB01) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PB01) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB01) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PB01) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PB01) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PB01) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PB01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB02) && (func == RTC_OUT2_FUNC            )) ?  0 : \
	((gpio == PB02) && (func == RTC_OUT_ALARM_FUNC       )) ?  0 : \
	((gpio == PB02) && (func == RTC_OUT_CALIB_FUNC       )) ?  0 : \
	((gpio == PB02) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PB02) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PB02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB03) && (func == SYS_JTDO_SWO_FUNC        )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PB03) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PB03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB04) && (func == SYS_JTRST_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PB04) && (func == TSC_G2_IO1_FUNC          )) ?  9 : \
	((gpio == PB04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PB05) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PB05) && (func == TSC_G2_IO2_FUNC          )) ?  9 : \
	((gpio == PB05) && (func == TIM16_BKIN_FUNC          )) ? 14 : \
	((gpio == PB05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PB06) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == TSC_G2_IO3_FUNC          )) ?  9 : \
	((gpio == PB06) && (func == TIM16_CH1N_FUNC          )) ? 14 : \
	((gpio == PB06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB07) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PB07) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == TSC_G2_IO4_FUNC          )) ?  9 : \
	((gpio == PB07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == TIM16_CH1_FUNC           )) ? 14 : \
	((gpio == PB08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB09) && (func == IR_OUT_FUNC              )) ?  1 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PB10) && (func == TSC_SYNC_FUNC            )) ?  9 : \
	((gpio == PB10) && (func == QUADSPI_CLK_FUNC         )) ? 10 : \
	((gpio == PB10) && (func == COMP1_OUT_FUNC           )) ? 12 : \
	((gpio == PB10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PB11) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB12) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PB12) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PB12) && (func == TSC_G1_IO1_FUNC          )) ?  9 : \
	((gpio == PB12) && (func == TIM15_BKIN_FUNC          )) ? 14 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PB13) && (func == TSC_G1_IO2_FUNC          )) ?  9 : \
	((gpio == PB13) && (func == TIM15_CH1N_FUNC          )) ? 14 : \
	((gpio == PB13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == TSC_G1_IO3_FUNC          )) ?  9 : \
	((gpio == PB14) && (func == TIM15_CH1_FUNC           )) ? 14 : \
	((gpio == PB14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == TSC_G1_IO4_FUNC          )) ?  9 : \
	((gpio == PB15) && (func == TIM15_CH2_FUNC           )) ? 14 : \
	((gpio == PB15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC00) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PC00) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PC00) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PC00) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PC00) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PC00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC01) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PC01) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PC01) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PC01) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PC02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC03) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PC03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC04) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC05) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC06) && (func == TSC_G4_IO1_FUNC          )) ?  9 : \
	((gpio == PC06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC07) && (func == TSC_G4_IO2_FUNC          )) ?  9 : \
	((gpio == PC07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC08) && (func == TSC_G4_IO3_FUNC          )) ?  9 : \
	((gpio == PC08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC09) && (func == TSC_G4_IO4_FUNC          )) ?  9 : \
	((gpio == PC09) && (func == USB_NOE_FUNC             )) ? 10 : \
	((gpio == PC09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC10) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == TSC_G3_IO2_FUNC          )) ?  9 : \
	((gpio == PC10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == TSC_G3_IO3_FUNC          )) ?  9 : \
	((gpio == PC11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC12) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == TSC_G3_IO4_FUNC          )) ?  9 : \
	((gpio == PC12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD02) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PD02) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD02) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD02) && (func == TSC_SYNC_FUNC            )) ?  9 : \
	((gpio == PD02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr == 15) && (channel_nr == -1)) ? 14 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr == 15) && (channel_nr ==  1)) ? 14 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr == 15) && (channel_nr ==  2)) ? 14 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr == 16) && (channel_nr ==  1)) ? 14 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB06) && (timer_nr == 16) && (channel_nr == -1)) ? 14 : \
	((gpio == PB08) && (timer_nr == 16) && (channel_nr ==  1)) ? 14 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PB13) && (timer_nr == 15) && (channel_nr == -1)) ? 14 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB14) && (timer_nr == 15) && (channel_nr ==  1)) ? 14 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB15) && (timer_nr == 15) && (channel_nr ==  2)) ? 14 : \
	AF_NO_SUCH_PINFUNC)
#endif
